In [101]:
#از کتابخوانه پانداس بیشتر به عنوان یک دیتا استراکتچر استفاده می شود که به ما این قابلیت را می دهد تا اطلاعاتی که دارید را
#به صورت دلخواه در سطرها و ستونهای آن نگهداری کنیم
# انواع دیتا استراکتچرها عبارت انداز:
#pandas.series
#سری ها دیتا استراکتچرهایی یک بعدی هستند و بیشتر برای نگهداری سری ها زمانی استفاده می‌شود و این قابلیت را دارد که برای هر سطر
#برچسب ایجاد کند

#برای به وجود آوردن سری ها در کدهای خود از عبارت زیر استفاده می کنیم
#pandas.series()

import pandas as pd
my_series = pd.Series([1,2,3,4,5], index=['row1','row2','row3','row4','row5'], dtype='int8')
my_series

row1    1
row2    2
row3    3
row4    4
row5    5
dtype: int8

In [102]:
#for see value =>my_series.value and for see your labels =>my_series.index
#شما همینطور میتوانید مقادیر ستونها را با استفاده از شماره سطر یا ایندکس آن فراخوانی کنید
my_series.row2

2

In [103]:
my_series['row2']

2

In [96]:
#Boolean Indexing
#برای اینکه برای مثال بخواهیم ستونهایی که دارای مقادیر بیش از 3 هستند را نمایش دهد به صورت زیر عمل می‌کنیم

my_series[my_series>3]

IV    4
V     5
dtype: int8

In [95]:
#حالا اگر بخواهیم برچسب هارا تغییر دهیم، باید به صورت زیر عمل کنیم
my_series.index = ['I','II','III','IV','V']
my_series

I      1
II     2
III    3
IV     4
V      5
dtype: int8

In [94]:
#pandas.dataframe
#این مدل از دبتا استراگتچرها به صورت دوبعدی بوده و بسیار پر کاربرد هستند
#در این روش می توان برای سطرها و ستونها برچسب قرار داد که برای ذخیره و نمایش داده ها میتوانند فرمتی عالی باشند
import numpy as np

my_array = np.array([[1,5,9,13],[2,5,10,14],[3,7,11,15],[4,8,12,16]])
my_df = pd.DataFrame(my_array, index =['row1','row2','row3','row4'], columns =['col1','col2','col3','col4'])
my_df

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     5    10    14
row3     3     7    11    15
row4     4     8    12    16

In [93]:
#این کار را می‌توان با یک دیکشنری به صورت زیر نیز انجام داد
my_dict = {'col1':[1,2,3,4], 'col2':[5,6,7,8], 'col3':[9,10,11,12], 'col4':[13,14,15,16]}
my_df = pd.DataFrame(my_dict, index =['row1','row2','row3','row4'], columns =['col1','col2','col3','col4'])
my_df

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [92]:
#برای مشاهده برچسبها از این کد استفاده کنید:                  
my_df.index

Index(['row1', 'row2', 'row3', 'row4'], dtype='object')

In [91]:
#برای مشاهده ستونها از این کد استفاده کنید:                    
my_df.columns

Index(['col1', 'col2', 'col3', 'col4', 'col5'], dtype='object')

In [90]:
#برای مشاهده تنها دیتا ها نیز از این دستور استفاده می‌کنیم:      
my_df.values

array([['1.', '5.', 9, 13, 21],
       ['2.', '6.', 10, 14, 22],
       ['3.', '7.', 11, 15, 23],
       ['4.', '8.', 12, 16, 24]], dtype=object)

In [88]:
#این دیتافریم چون دوبعدی است ما می‌توانیم تمامی اطلاعات ستونها یا سطرهارا نیز به صورت زیر استخراج کنیم

my_df.loc['row1'][:]

col1    1.
col2    5.
col3     9
col4    13
col5    21
Name: row1, dtype: object

In [87]:
my_df.loc['row1']['col2']

'5.'

In [85]:
#اگر بخواهیم بجای اسم برچسب ها از ایندکس آنها اسنفاده کنیم باید به صورت زیر عمل کنیم
my_df.iloc[0][:]

col1    1.
col2    5.
col3     9
col4    13
col5    21
Name: row1, dtype: object

In [84]:
my_df.iloc[0][2]

9

In [86]:
# اگر بخواهیم مقادیر را تغییر دهیم به صورت زیر عمل می کنیم:
my_df['col5']=[21,22,23,24]

In [106]:
#برای تغییر ستونهای خاص هم اینطوری کار خواهیم کرد
my_df.loc[['row1','row2'],'col1'] = 0
my_df

      col1  col2  col3  col4
row1     0     5     9    13
row2     0     5    10    14
row3     3     7    11    15
row4     4     8    12    16

In [80]:
#برای حدف برچسب ها باید از کد زیر استفاده کنید
my_df.reset_index(drop=True)

  col1 col2  col3  col4
0   1.   5.     9    13
1   2.   6.    10    14
2   3.   7.    11    15
3   4.   8.    12    16

In [79]:
#برای حذف کامل نیز به صورت زیر عمل می کنیم
my_df.drop('col4',axis=1)

#منظوز از axis=1 یعنی روی ستونها دنبال دستور موردنطر بگرد

     col1 col2  col3
row1   1.   5.     9
row2   2.   6.    10
row3   3.   7.    11
row4   4.   8.    12

In [78]:
#تغییر نام سطر یا ستون
my_df.rename(columns={'col4':'Columns 4'})

     col1 col2  col3  Columns 4
row1   1.   5.     9         13
row2   2.   6.    10         14
row3   3.   7.    11         15
row4   4.   8.    12         16

In [77]:
# بسیار پیش می‌آید که برای نرمال سازی، برخی داده هارا بخواهیم حذف کنیم. با کد زیر میتوانیم برای مثال تمامی 1 هارا به  0 تغییر دهیم

my_df.replace({1:0})

     col1 col2  col3  col4
row1   1.   5.     9    13
row2   2.   6.    10    14
row3   3.   7.    11    15
row4   4.   8.    12    16

In [74]:
#برای استفاده از توابع در کتابخوانه ها می توانیم به شکل زیر استفاده کنیم
my_df.col1 = ['{:.2}'.format(x) for x in my_df.iloc[:,0]]
my_df

     col1  col2  col3  col4
row1   1.  5.00     9    13
row2   2.  6.00    10    14
row3   3.  7.00    11    15
row4   4.  8.00    12    16

In [76]:
my_df['col2'] = my_df['col2'].apply(lambda x:'{:.2}'.format(x))
my_df

     col1 col2  col3  col4
row1   1.   5.     9    13
row2   2.   6.    10    14
row3   3.   7.    11    15
row4   4.   8.    12    16

In [71]:
#sorting
my_df.sort_index(axis=1, ascending=False)

      col4  col3  col2 col1
row1    13     9  5.00   1.
row2    14    10  6.00   2.
row3    15    11  7.00   3.
row4    16    12  8.00   4.

In [72]:
my_df.sort_index(axis=0, ascending=False)

     col1  col2  col3  col4
row4   4.  8.00    12    16
row3   3.  7.00    11    15
row2   2.  6.00    10    14
row1   1.  5.00     9    13

In [70]:
my_df.sort_values(by='col1', ascending=True)

     col1  col2  col3  col4
row1   1.  5.00     9    13
row2   2.  6.00    10    14
row3   3.  7.00    11    15
row4   4.  8.00    12    16

In [69]:
#چند متد دیگر هم داریم که بسیار مفید هستند
#برای مثال شما میخواهید فقط 5 سطر اول را به شما نمایش دهد
my_df.head(2)

#اگر چیزی نزاریذ به صورت پیش فرض 5 سطر را برخواهد گرداند

     col1  col2  col3  col4
row1   1.  5.00     9    13
row2   2.  6.00    10    14

In [68]:
# برای دریافت خروجی از آخر لیست هم به صورت زیری عمل می کنیم
my_df.tail(2)

     col1  col2  col3  col4
row3   3.  7.00    11    15
row4   4.  8.00    12    16

In [67]:
#insert data
dmoz = pd.read_csv('dmoz.csv')
dmoz

,Unnamed: 0,category,title,desc
0,1,Arts,About.com: Animation Guide,Keep up with developments in online animation ...
1,2,Arts,Toonhound,"British cartoon, animation and comic strip cre..."
2,3,Arts,Enculturation: From Mouse to Mouse: Overcoming...,Essay by Patricia Pisters on the animated imag...
3,4,Arts,Digital Media FX: The History of Animation,Michael Crandol takes an exhaustive look at th...
4,5,Arts,Spark Online: Only Genius Is Genius,Chris Romano feels that the proliferation of F...
...,...,...,...,...
1195846,2196856,Sports,MaxPreps.com,High school sports and athletes as well as spo...
1195847,2196857,Sports,My Score,"High school sports scores, standings, and sche..."
1195848,2196858,Sports,Sports Illustrated: High School Sports,"News, analysis, commentary, feature articles, ..."
1195849,2196859,Sports,Sports Illustrated: High School Sports,Headline news and feature stories.
1195850,2196860,Sports,USA Today: Preps,Features high school news and the Super 25 Ind...

In [66]:
amazon_nodes = pd.read_json('nodes.json')
amazon_nodes.head(10)

,id,name,child_nodes
0,2619526011,Appliances,"[{'id': '17921061011', 'name': 'Refrigerators,..."
1,2617942011,"Arts, Crafts & Sewing","[{'id': '2747968011', 'name': 'Painting, Drawi..."
2,15690151,Automotive,"[{'id': '15718271', 'name': 'Car Care', 'child..."
3,165797011,Baby,"[{'id': '239225011', 'name': 'Activity & Enter..."
4,11055981,Beauty,"[{'id': '11058281', 'name': 'Makeup', 'child_n..."
5,1000,Books,"[{'id': '1', 'name': 'Arts & Photography', 'ch..."
6,4991426011,Collectibles & Fine Arts,"[{'id': '7301170011', 'name': 'Advertising', '..."
7,493964,Electronics,"[{'id': '281407', 'name': 'Accessories & Suppl..."
8,7141124011,"Clothing, Shoes & Jewelry","[{'id': '7147440011', 'name': 'Women', 'child_..."
9,7147444011,"Clothing, Shoes & Jewelry - Baby","[{'id': '7628012011', 'name': 'Baby Girls', 'c..."

In [ ]:
#pandas.panel
#این دیتا استراکتچرها بسیار قدرتمند و 3بعدی هستند ولی به دلیل استفاده کم کاربران از آنها تصمیم به حذف کامل آنها از این کتابخوانه شد
# و در کتابخوانه های کنونی این قابلیت وجود ندارد!